EDT/УТ/src/Documents/новаКорректировкаВозможногоРейса/новаКорректировкаВозможногоРейса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаКорректировкаВозможногоРейса</name>
  <registerRecords>InformationRegister.новаКорректировкаКалендаряВозможныхРейсов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.новаПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйТранспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйВодитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>НовоеНачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйЭкспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>НовоеНачалоРейса</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйПеревозчик</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйДоговор</name>
    <type>
      <types>CatalogRef.новаДоговоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НовоеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.новаКонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НовоеНаправление</name>
    <type>
      <types>CatalogRef.новаНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/новаКорректировкаКалендаряВозможныхРейсов/новаКорректировкаКалендаряВозможныхРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаКорректировкаКалендаряВозможныхРейсов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НовыйТранспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>НовыйВодитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>НовоеНачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НовыйКонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НовоеНачалоРейса</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </resources>
  <resources>
    <name>НовыйЭкспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>НовыйПеревозчик</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </resources>
  <resources>
    <name>НовыйДоговор</name>
    <type>
      <types>CatalogRef.новаДоговоры</types>
    </type>
  </resources>
  <resources>
    <name>НовоеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.новаКонтактныеЛица</types>
    </type>
  </resources>
  <resources>
    <name>НовоеНаправление</name>
    <type>
      <types>CatalogRef.новаНаправления</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/новаКорректировкаВозможногоРейса/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движение = Движения.новаКорректировкаКалендаряВозможныхРейсов.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект, "Транспорт, Водитель, НачалоПериода, Отменен");
	Если Не Отменен Тогда
		ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	КонецЕсли;
	
	Если Не Отменен Тогда
		ПеренесенныйТранспорт = ?(ЗначениеЗаполнено(НовыйТранспорт), НовыйТранспорт, Транспорт);
		ПеренесенныйВодитель = ?(ЗначениеЗаполнено(НовыйВодитель), НовыйВодитель, Водитель);
		
		Если Транспорт <> ПеренесенныйТранспорт Или Водитель <> ПеренесенныйВодитель Тогда
			Движение = Движения.новаКорректировкаКалендаряВозможныхРейсов.Добавить();
			Движение.Транспорт = ПеренесенныйТранспорт;
			Движение.Водитель = ПеренесенныйВодитель;
			Движение.НачалоПериода = НачалоПериода;
			Движение.Отменен = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
